lib/interactors/parse_order.rb

    def initialize_billing_info
    	if billing_info = BillingInfo.create(params[:buyer][:billing_info])
---
INSERT INTO "billing_infos" ("doc_type", "doc_number") VALUES ($1, $2) RETURNING "id"  [["doc_type", "CPF"], ["doc_number", "09487965477"]]

    def initialize_phone
    	if phone = Phone.create(params[:buyer][:phone])
---
INSERT INTO "phones" ("area_code", "number") VALUES ($1, $2) RETURNING "id"  [["area_code", 41], ["number", "999999999"]]

    def initialize_city
    	if city = City.create(params[:shipping][:receiver_address][:city])
---
INSERT INTO "shippings" ("id", "shipment_type", "date_created", "receiver_address_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 43444211797], ["shipment_type", "shipping"], ["date_created", "2019-06-24 20:45:33"], ["receiver_address_id", 1051695306]]
INSERT INTO "cities" ("name") VALUES ($1) RETURNING "id"  [["name", "Cidade de Testes"]]

    def initialize_state
    	if state = State.create(params[:shipping][:receiver_address][:state])
---
INSERT INTO "states" ("name") VALUES ($1) RETURNING "id"  [["name", "São Paulo"]]

    def initialize_country
      map_to_external_id(params[:shipping][:receiver_address][:country])

    	if country = Country.create(params[:shipping][:receiver_address][:country])
---
INSERT INTO "countries" ("external_id", "name") VALUES ($1, $2) RETURNING "id"  [["external_id", "BR"], ["name", "Brasil"]]

    def initialize_neighborhood
      map_to_external_id(params[:shipping][:receiver_address][:neighborhood])

    	if neighborhood = Country.create(params[:shipping][:receiver_address][:neighborhood])
---
INSERT INTO "countries" ("name") VALUES ($1) RETURNING "id"  [["name", "Vila de Testes"]]

    def initialize_payments
    	payments = []
    	params[:payments].each do |payment|
        map_to_external_id(payment)

	  		if payment = Payment.create(payment)
---
INSERT INTO "payments" ("id", "order_id", "payer_id", "installments", "payment_type", "status", "transaction_amount", "taxes_amount", "shipping_cost", "total_paid_amount", "installment_amount", "date_approved", "date_created") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def initialize_order_items
    	order_items = []
    	params[:order_items].each do |order_item|
        map_to_external_id(order_item[:item])

    		item = Item.create(order_item[:item])

    		if order_item = OrderItem.new(order_item.except(:item))
    			order_item.item_id = item.id
    			order_item.save
    			order_items << order_item
---
INSERT INTO "items" ("external_id", "title") VALUES ($1, $2) RETURNING "id"  [["external_id", "IT4801901403"], ["title", "Produto de Testes"]]
INSERT INTO "items" ("id", "title") VALUES ($1, $2) RETURNING "id"  [["id", 0], ["title", "Produto de Testes"]]

    def initialize_receiver_address
    	if receiver_address = ReceiverAddress.new(params[:shipping][:receiver_address]
    		.except(:state, :city, :country, :neighborhood))

    		receiver_address.city_id          = context.city.id
    		receiver_address.state_id         = context.state.id
    		receiver_address.country_id       = context.country.id
    		receiver_address.neighborhood_id  = context.neighborhood.id

    		receiver_address.save
---
INSERT INTO "shippings" ("id", "shipment_type", "date_created", "receiver_address_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 666], ["shipment_type", "shipping"], ["date_created", "2019-06-24 20:45:33"], ["receiver_address_id", 1051695306]]

    def initialize_shipping
      map_to_external_id(params[:shipping])

    	if shipping = Shipping.new(params[:shipping].except(:receiver_address))
    		shipping.receiver_address = context.receiver_address

    		shipping.save
---
INSERT INTO "shippings" ("external_id", "shipment_type", "date_created", "receiver_address_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["external_id", "666"], ["shipment_type", "shipping"], ["date_created", "2019-06-24 20:45:33"], ["receiver_address_id", 1051695306]]

    def initialize_order
      map_to_external_id(params)

  		if order = Order.new(params.except(:order_items, :payments, :shipping, :buyer))
  			order.order_items << context.order_items
  			order.payments << context.payments
  			order.shipping = context.shipping
  			order.buyer = context.buyer

  			order.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 9987071]]
SELECT "payments".* FROM "payments" WHERE "payments"."order_id" = $1  [["order_id", 9987071]]
INSERT INTO "order_items" ("order_id", "item_id", "quantity", "unit_price", "full_unit_price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 7], ["item_id", 8], ["quantity", 1], ["unit_price", 49.9], ["full_unit_price", 49.9]]
INSERT INTO "orders" ("external_id", "store_id", "date_created", "date_closed", "total_amount", "total_shipping", "total_amount_with_shipping", "paid_amount", "expiration_date", "shipping_id", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "order_items" ("order_id", "item_id", "quantity", "unit_price", "full_unit_price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 5], ["item_id", 5], ["quantity", 1], ["unit_price", 49.9], ["full_unit_price", 49.9]]
INSERT INTO "payments" ("external_id", "order_id", "payer_id", "installments", "payment_type", "status", "transaction_amount", "taxes_amount", "shipping_cost", "total_paid_amount", "installment_amount", "date_approved", "date_created") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"