lib/interactors/save_order.rb

UPDATE "orders" SET "address_id" = $1, "customer_id" = $2 WHERE "orders"."id" = $3  [["address_id", 1], ["customer_id", 1], ["id", 1]]
---
    def save_order
      @order = Order.where(context.order).first_or_initialize
      @order.address_id = @address.id
      @order.customer_id = @customer.id
      @order.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "addresses" ("country", "state", "city", "district", "street", "complement", "latitude", "longitude", "postalCode", "number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def save_address
      @address = Address.where(context.address).first_or_create

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "customers" ("externalCode", "name", "email", "contact") VALUES ($1, $2, $3, $4) RETURNING "id"  [["externalCode", "136226073"], ["name", "JOHN DOE"], ["email", "john@doe.com"], ["contact", "41 999999999"]]
---
    def save_customer
      @customer = Customer.where(context.customer[:customer]).first_or_create

UPDATE "payments" SET "order_id" = $1 WHERE "payments"."id" = $2  [["order_id", 1], ["id", 1]]
---
    def save_payments
      context.payments[:payments].each do |payment|
        payment[:kind] = payment.delete :type
        payment_result = Payment.where(payment).first_or_initialize
        payment_result.order_id = @order.id
        payment_result.save

INSERT INTO "items" ("externalCode", "name", "price") VALUES ($1, $2, $3) RETURNING "id"  [["externalCode", "IT4801901403"], ["name", "Produto de Testes"], ["price", 49.9]]
SELECT  "items".* FROM "items" WHERE "items"."externalCode" = $1 AND "items"."name" = $2 AND "items"."price" = $3 ORDER BY "items"."id" ASC LIMIT $4  [["externalCode", "IT4801901403"], ["name", "Produto de Testes"], ["price", 49.9], ["LIMIT", 1]]
INSERT INTO "order_items" ("order_id", "item_id", "quantity", "total") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 1], ["item_id", 1], ["quantity", 1], ["total", 49.9]]
---
    def save_items
      context.items[:items].each do |item|
        result_item = Item.where(item.except(:quantity, :total)).first_or_create
        order_item = OrderItem.new(item.except(:externalCode, :name, :price))
        order_item.item_id = result_item.id
        order_item.order_id = @order.id
        order_item.save